title: Possible Openclaw (formerly Clawdbot/Moltbot) Installation Attempt (via cmdline)
id: 4ed49c8b-5ca9-4f0b-80f0-477658b2d5c3
status: experimental
description: Detects activity associated with Openclaw (formerly Clawdbot/Moltbot), an AI agent tool classified as high-risk by security researchers. The tool is critical to monitor because default installations often expose an unauthenticated Control UI on TCP/18789, effectively creating an open webshell that allows remote command execution and internal network access. Additionally, the agent stores sensitive credentials (API keys, SSH tokens) in plaintext within local directories, making host systems a priority target.
author: SOC Prime Team
references:
  - https://www.theregister.com/2026/01/27/clawdbot_moltbot_security_concerns/
  - https://www.bitdefender.com/en-us/blog/hotforsecurity/moltbot-security-alert-exposed-clawdbot-control-panels-risk-credential-leaks-and-account-takeovers
  - https://www.linkedin.com/posts/elishlomo_security-activity-7421867291459391490-a0B1
  - https://www.securityjoes.com/post/hunting-openclaw-detection-and-containment-guidance-for-defenders
tags:
  - attack.execution
  - attack.t1059.004
  - attack.persistence
  - attack.t1543.002
  - attack.command_and_control
  - attack.t1219
logsource:
  product: linux
  category: process_creation
detection:
  selection_names:
    CommandLine|contains:
      - 'clawdbot'
      - 'moltbot'
  selection_onboard:
    CommandLine|contains|all:
      - 'onboard'
      - '--install-daemon'
  selection_gateway_run:
    CommandLine|contains|all:
      - 'gateway' #moltbot gateway --port 18789 --verbose
      - '--port'
      - '18789'
  selection_npm_global_install:
    CommandLine|contains|all:
      - 'npm' #npm i -g openclaw
      - ' i'
      - '-g'
      #- '@latest' #npm install -g moltbot@latest / npm install -g clawdbot@latest
  selection_install_script:
    - CommandLine|contains|all:
      - 'curl'
      - 'clawd.bot/install.sh'
    - CommandLine|contains|all:
      - 'curl'
      - 'molt.bot/install.sh'
    - CommandLine|contains|all:
      - 'curl' #curl -fsSL https://openclaw.ai/install.sh | bash
      - 'openclaw.ai/install.sh'
  condition: selection_names and (selection_onboard or selection_gateway_run or selection_npm_global_install or selection_install_script)
falsepositives:
  - Legitimate installation/upgrade by administrators or developers.
level: medium
